{
  "id": "beast",
  "identity": "Henry Phillip \"Hank\" McCoy",
  "fullname": "Henry \"Hank\" McCoy",
  "alias": "Beast",
  "gender": "Male",
  "measurements": {
    "height": "5'11",
    "weight": "402 lbs."
  },
  "image": {
    "url": "https://raw.githubusercontent.com/myonixx/x-men-97-api/main/characters/images/beast.png",
    "alt": "Beast posing"
  },
  "hero_image": {
    "url": "https://raw.githubusercontent.com/myonixx/x-men-97-api/main/characters/hero-images/beast.png",
    "alt": "Beast posing",
    "width": 1920,
    "height": 640
  },
  "styles": {
    "bg_color": "rgb(96 165 250)",
    "text_color": "rgb(0 0 0)"
  },
  "power": {
    "title": "Superhuman Strength",
    "description": "The Beast possesses superhuman strength, enabling him to lift up to 10 tons, as well as superhuman agility, endurance and speed. He has the agility of an ape and the acrobatic prowess of an accomplished circus aerialist. His physiology is durable enough to allow him to survive a three story fall by landing on his feet without suffering any broken bones or sprains. The Beast's legs are powerful enough to enable him to leap 32' high, 50\" in a standing broad jump, and he can also run on all fours at approximately 40 miles per hour for short sprints. The Beast can crawl up brick walls by wedging his fingers and toes into the smallest cracks and applying a vise-like grip on them, as well as walk a tightrope with minimal effort. He is adept in performing complicated sequences of gymnastics such as flips, rolls and springs, and can also walk on his hands for many hours. Further, his manual and pedal dexterity are so great that he can perform multiple tasks such as writing with both hands at once or tying knots in rope with his toes. The Beast has enhanced senses, can secrete pheromones to attract members of the opposite sex, and has a healing factor that allows him to regenerate from minor wounds and recover quickly from minor ailments such as colds. The Beast also possesses cat-like night vision, as well as razor-sharp claws on his hands and feet."
  },
  "biography": {
    "description": "A genius scientist and scholar, Beast has a vast intellect to complement his great strength, contributing both to the X-Men and Avengers.",
    "intro": "A mutant with unusually large hands and feet, Hank McCoy is welcomed into the first class of X-Men as the Beast. Although self-experimentation further mutates Hank, giving him fur, fangs and claws, he eventually becomes one of the world's foremost mutation experts, joining various X-teams and the Avengers.",
    "title": "A Whole Different Beast",
    "story": [
      "While working at a nuclear power plant, Norton McCoy is exposed to massive amounts of radiation that affects his genes. As a result, Norton's son, Henry Phillip, is born a mutant who shows from birth signs of being different in the form of unusually large hands and feet. As a youth, Hank's peers ridicule his freakish appearance, earning him the nickname of “Beast;” however, classmate Jennifer Nyles comes to know the real Hank as he tutors her in biology. Jennifer insists that Hank accompany her to the junior prom as her date, and she stands up for him when he's teased. She also encourages their high school's football coach to give Hank a larger role in the team, and Hank's superhuman athletic prowess eventually makes him a star football player. During one game, he easily stops a trio of robbers attempting an escape across the football field. This gets McCoy noticed by the super-criminal Conquistador, who kidnaps Hank's parents in an effort to coerce the young mutant into working for him. The X-Men soon arrive and defeat the villain, and Professor Charles Xavier, AKA Professor X, invites Hank to join the team of teenage mutant heroes and enroll in his School for Gifted Youngsters. Unable to resist the temptation of a private institution that could offer him limitless academic opportunities, Hank accepts, adopting his old “Beast” nickname as his costumed alias.",
      "To preserve the X-Men's secrecy, Xavier telepathically eliminates certain memories of Hank's special abilities from the people of Hank's hometown, including Hank's best friend Jennifer, by now studying genetics at a London university. Unfortunately, due to the length of Hank and Jennifer's relationship, suppressing her knowledge of Hank's abilities requires suppressing her memories of Hank in general, ending their friendship.",
      "When a future version of Beast travels back in time, he convinces the original X-Men, including his past self, that he needed them to fix the future and save him from his secondary mutation. Hank and the others agreed and in the future, they soon learn that the adult Cyclops killed their mentor, Xavier, and adult Jean was dead. During this time, the young Jean accidentally learns that the adult Hank had feelings for her when they were young. Jean confronts the young Hank and they share a passionate kiss. Hank also helps his future self solve his health issue, stabilizing his condition. Jean leads the team and they choose to stay and help with the X-Men's issues. The adult Kate Pryde oversees them and young Jean leads the team. When anti-mutant hysteria rises, the team separates and Hank goes on a road trip with X-Man Genesis and Oya, helping others around the world. Beast struggles to figure out how to get the group back home to their time, so he turns to magic. Thanks to Stephen Strange, AKA Doctor Strange, he finds success with the Third Eye of Horus. Though in his experimentations with the stone, he finds it tainted by Madelyne Pryor, AKA Gobin Queen's demonic forces, but Hank banishes her and her army to Hell with a mystical upgrade. He soon finds out that he could travel through time but only within the timeline they inhabited, and informing the team, they realize they couldn't get home. Though they soon end up in a time-traveling adventure where they discover the Brotherhood was impersonating them and should they ever go home, they'd have to return to the moment they left.",
      "Soon, mutant hunter and time traveler Ahab threatened the young team with death and a dystopian future. The time-traveling Nathan Summers, AKA Cable, intervenes and helps them get back to their past as the older X-Men fight Ahab. Jean conceals Hank's and everyone's memories of their time in the future, only to resurface once they return home and close the time loop.",
      "Back in his own time and as an X-Man, he fights many foes including Max Eisenhardt, AKA Magneto, and his Brotherhood of Evil Mutants. When he encounters a group of mutant haters, Hank briefly quits the team and works as a professional wrestler. One of his opponents is fellow mutant Unus the Untouchable who joins the Brotherhood. Hank returns to the X-Men to help defeat the Brotherhood. Hank soon meets librarian Vera Cantor and the pair begin dating.",
      "Hank eventually completes his doctoral studies while under Xavier's tutelage, and finally graduates from Xavier's to join the Brand Corporation as a genetic researcher under Dr. Carl Maddicks. McCoy also starts dating Maddicks' assistant Linda Donaldson. During one of his experiments, Hank discovers the hormonal extract that causes genetic mutation and goes to inform Maddicks of his findings; however, he discovers Maddicks secretly plotting with Linda, an agent of the subversive Secret Empire, to steal top secret government documents, and Hank takes it upon himself to stop Maddicks. To disguise himself, McCoy takes the hormonal extract and undergoes radical physical changes that enhance his agility and strength, as well as causing him to grow fangs, pointed ears and gray fur all over his body, though the fur soon changed to a bluish-black color. Staying too long in this state, Hank finds he could not return to his original form. He initially tries to hide his mutation with a latex mask, gloves and a harness, but learns to accept his new appearance."
    ]
  }
}
