{
  "id": "gambit",
  "identity": "Remy Etienne LeBeau",
  "fullname": "Remy LeBeau",
  "alias": "Gambit",
  "gender": "Male",
  "measurements": {
    "height": "6'2",
    "weight": "179 lbs."
  },
  "image": {
    "url": "https://raw.githubusercontent.com/myonixx/x-men-97-api/main/characters/images/gambit.png",
    "alt": "Gambit posing"
  },
  "hero_image": {
    "url": "https://raw.githubusercontent.com/myonixx/x-men-97-api/main/characters/hero-images/gambit.png",
    "alt": "Gambit posing",
    "width": 1920,
    "height": 640
  },
  "styles": {
    "bg_color": "rgb(251 113 133)",
    "text_color": "rgb(0 0 0)"
  },
  "power": {
    "title": "Kinetic Energy",
    "description": "Via direct physical contact, Gambit can transform the potential energy (stored energy and the energy of position—gravitational energy) contained within an inorganic object, converting it into kinetic (energy of motion) energy; specifically, this is biokinetic energy, kinetic energy generated by living beings. Once he has energized an object, Gambit can mentally cause it to explode with concussive force after a set time limit, though he usually allows such an object to detonate upon impact. By charging an object and keeping it close to his forehead, he can create a static interference that shields his mind from telepathic detection and intrusion by even the most powerful telepaths. Gambit cannot use this power to charge organic objects."
  },
  "biography": {
    "description": "Known as the Ragin' Cajun, Gambit is one of the foremost professional thieves in the world and becomes one of the X-Men's most powerful weapons.",
    "intro": "A master of kinetic energy, Remy LeBeau starts out as a thief and foe to the X-Men but becomes a reliable ally to the merry mutants.",
    "title": "An Ace Up His Sleeve",
    "story": [
      "Gambit is allegedly a product of Black Womb, a black-ops government-funded project involved in the investigation and initiation of human mutation using recently acquired advanced extraterrestrial technology, under the guidance of geneticist Nathan Milbury (Nathan Essex, AKA Mister Sinister), Amanda Mueller and others. It is believed that Black Womb's experimentation upon a couple produces, either in their son or grandson, a mutant infant with burning red eyes whom they abandon in a New Orleans hospital. Believing the child to be le diable blanc (“the white devil”), the one prophesied to restore the Old Kingdom, Thieves' Guild patriarch Jean-Luc LeBeau follows the instructions of the Guild's prophet, the Antiquary, and kidnaps the infant from the hospital, placing him in the care of a gang of street thieves led by expatriate Guild member Fagan who raises the child (now named Remy) and teaches him the ways of thievery. ",
      "When Remy is around 8 years old, Remy seeks to save a young girl from being accosted by a group of thugs; however, the girl turns out to be Bella Donna Boudreaux, daughter of the Assassins Guild's patriarch and trained since birth in the killing arts. Remy and Bella Donna become best friends and eventually fall in love. When he's around 10 years old, Remy tries to pickpocket Jean-Luc, who takes the boy in off the streets and adopts him into his own family. Remy's mutant nature manifests at puberty, though he keeps it secret.",
      "At age 15, Remy accompanies his cousin and best friend Etienne Marceaux on his “Tilling,” the ritual initiation test of the Thieves' Guild; however, they are captured by the immortal mutant Candra and sells them to the deformed mutant slave trader the Pig, who plans to sell them and others to Hydra to train as soldiers. Remy escapes imprisonment and discovers his trademark move when he picks up a playing card that Etienne had dropped, charges it with energy and throws it at the Pig. Fleeing the Pig's clifftop headquarters by diving into the sea, Remy was rescued by a passing trawler, but Etienne drowns.",
      "When nearly 18 years old, Remy travels to Paris with his adoptive brother Henri to undergo a tract of passage into the Guild by stealing the valuable pendant named l'Etroile du Tricherie (“the Cheating Star”) from Canadian financier Martin Herzog; however, Genevieve Darcenaux had already stolen the pendant, and Herzog had hired the mercenary Victor Creed, AKA Sabretooth, to retrieve it. After Gambit successfully seduces Genevieve and takes the jewel, Sabretooth captures both Genevieve and Henri. Forcing Gambit to return the jewel, Sabretooth drops them both from the Notre Dame cathedral. Gambit chooses to save Henri, learning too late that Genevieve truly loved him and would have given him the pendant. Subsequently, as part of a peace pact between the Thieves Guild and the Assassins Guild, a marriage is arranged between Remy and Bella Donna; however, Bella Donna's brother Julien objects to the union and challenges Remy to a duel. Remy kills Julien in self-defense, but the Guild excommunicates Remy from the Guild and banishes him from New Orleans in an attempt to maintain the nonaggression pact between the two guilds."
    ]
  }
}
