{
  "id": "tolerance-is-extinction-part-3",
  "season": 1,
  "season_episode": 10,
  "series_episode": 10,
  "title": "Tolerance is Extinction - Part 3",
  "release_date": "May 15, 2024",
  "styles": {
    "bg_color": "rgb(2, 47, 130)",
    "text_color": "rgb(147 197 253)"
  },
  "image": {
    "url": "https://raw.githubusercontent.com/myonixx/x-men-97-api/main/images/episodes/tolerance-is-extinction-part-3.png",
    "alt": "Storm and Jean struggle while casting their mutant powers"
  },
  "synopsis": "The X-Men's dream is put to the test as mutant-human relations reach a tipping point.",
  "plot": "Shortly after Magneto critically injures Wolverine, Xavier uses his telepathic powers to override Magneto's mind and shut down the EMP. The Prime Sentinels are reactivated and continue wreaking havoc around the world. Just as Bastion prepares to execute Cable, Jean re-emerges as Phoenix and places the collar on Bastion, immediately deactivating the Prime Sentinels. She then takes away Sinister's powers and control over Cable before the Phoenix Force disappears. Bastion rips Cable's cybernetic arm and merges with it to upgrade himself and fly towards Asteroid M. Upon his arrival, he is confronted by Blue Team. Meanwhile, Xavier struggles to save Magneto's mind. Gold Team arrive on Asteroid M in a commandeered Sentinel to join Blue Team in the fight. Cyclops tells the X-Men to stand down before he attempts to reason with Bastion, but missiles launched by the U.S. military bombard Asteroid M. Bastion is killed by the core reactor's explosion as the asteroid descends back to Earth. The X-Men use their combined effort to stop the asteroid from crashing on the East Coast. Magneto regains consciousness and sends the asteroid back into space before it explodes, presumably taking him and the X-Men in the process. Six months later, Bishop pays Forge a visit and tells them the X-Men are trapped in time. Cyclops and Jean end up in 3960 A.D., where they encounter Mother Askani and a child Nathan. Meanwhile, Rogue, Nightcrawler, Beast, Xavier, and Magneto find themselves in Ancient Egypt in 3000 B.C., where they meet En Sabah Nur."
}
